Repository: robot-xliff-farmer/mapsapi-examples
Catalog: mapsapi-examples.tmx
Source language: ru
Languages: en

source: Получаем от родителя контейнер, в который должен быть добавлен элемент управления, и выставляем макету родительский элемент.
en: Getting from the parent the container that the control must be added to, and setting the parent element for the layout.

source: @returns {IControlParent} Родительский объект.
en: @returns {IControlParent} The parent object.

source: Примеры. Собственный элемент управления API 2.1.
en: Examples. A custom control for the API 2.1.

source: Функция [#$dp6] позволяет загружать результаты геокодирования, которые представляют собой документ в формате YMapsML.
en: The [#$dp6] function allows loading geocoding results as a YMapsML document.

source: После того как данные будут загружены, функция преобразует их в коллекцию GeoObjectCollection, которую можно отобразить на карте.
en: After data is loaded, the function converts it to a GeoObjectCollection that can be displayed on the map.

source: Загрузка результатов геокодирования.
en: Loading geocoding results.

source: Границы области карты, в которую входит найденный объект.
en: Boundaries of the map area that contains the found object.

source: Добавление геообъекта на карту.
en: Adding a geo object to the map.

source: Изменение области показа карты.
en: Changing the map viewport.

source: Вызывается в случае неудачной загрузки данных.
en: Called if data loading was unsuccessful.

source: Примеры YMapsML. Отображение результатов геокодирования.
en: YMapsML example. Displaying geocoding results.

source: Dom-элементы могут генерировать на себе различные типы событий в зависимости от браузера и устройства. Например, при наведении мышкой на объект может быть сгенерировано событие 'mousedown', а при нажатии на элемент пальцем на экране планшета - событие 'touchstart'. API Яндекс.Карт преобразует различные события браузеров в единый список событий. Таким образом, вы можете писать один и тот же код по обработке dom-событий во всех браузерах и устройствах, которые поддерживаются API.
en: Dom elements can generate different types of events, depending on the browser and device. For example, hovering the mouse over an object can generate the 'mousedown' event, and touching an item on a tablet screen can generate the 'touchstart' event. The Yandex.Maps API converts various browser events to a single list of events. This means you can write the same code for handling dom events in all browsers and on all devices that are supported by the API.

source: Список событий, которыми оперирует API, и схему преобразования событий можно посмотреть в описании интерфейса [#$dp8]. Подписываться на события dom-элементов можно с помощью [#$dp9].
en: To view the list of events the API uses and how events are transformed, see the description of the [#$dp8] interface. To subscribe to events on dom elements, you can use [#$dp9].

source: Даже если пользователь коснется элемента на экране планшета, такие события, как 'touchstart', 'touchmove' и прочие, будут преобразованы в единый список событий. Это позволяет писать кроссплатформенный код и не задумываться о типе устройства.
en: Even if the user touches the element on a tablet screen, events such as 'touchstart', 'touchmove' and others will be converted into a single list of events. This allows you to write cross-platform code and not to think about the type of device.

source: Погладь кота!
en: Pet the cat!

source: Очистить
en: Clear

source: Ещё один пример работы с событиями геообъекта - изменение значка метки при наведении на него указателя мыши.
en: Another example of working with geo object events - changing the placemark icon when the mouse pointer hovers over it.

source: Примеры. Смена значка метки при наведении
en: Examples. Changing a placemark icon when hovering over it

source: Ссылку на объект, вызвавший событие, можно получить из поля 'target'.
en: A reference to the object that triggered the event; you can get it from the 'target' field.

source: Метка может быть создана двумя способами: с помощью класса GeoObject с указанным типом геометрии "точка" либо с помощью вспомогательного класса Placemark.
en: There are two ways to create a placemark: using the GeoObject class with the "point" geometry type, or using the Placemark auxiliary class.

source: При создании метки нужно указать координаты соответствущей точки. Также метке можно задать её свойства (например, текст значка) и опции (например, изображение значка).
en: When creating a placemark, you need to specify the coordinates of the corresponding point. You can also set the placemark's properties (such as the icon text) and options (such as the icon image).

source: Метки можно объединять в коллекции, а также кластеры (см. примеры Коллекции геообъектов и Кластер метки).
en: Placemarks can be grouped into collections, as well as clusters (see the examples Collection of geo objects and Placemark cluster).

source: Примеры. Метка
en: Examples. Placemark

source: Создаем геообъект с типом геометрии "Точка".
en: Creating a geo object with the "Point" geometry type.

source: Описание геометрии.
en: The geometry description.

source: Контент метки.
en: The placemark content.

source: Опции. Иконка метки будет растягиваться под размер ее содержимого.
en: Options. The placemark's icon will stretch to fit its contents.

source: Метку можно перемещать.
en: The placemark can be moved.

source: В примере используется макет балуна кластера "cluster#balloonTwoColumns". Данный макет состоит из двух колонок: списка всех геообъектов и информации о выбранном геообъекте. Информация о выбранном геообъекте задается отдельным макетом и может быть настроена при помощи опции 'clusterBalloonItemContentLayout'. В данном примере задается собственный макет с информацией о геообъекте. Макеты объектов можно создавать с помощью фабрики [#$dp10], используя текcтовые шаблоны. Текстовые шаблоны формируют html-содержимое макета на основе хэша с данными, передаваемого в конструктор макета. В данном примере поставщик данных - это выбранный в левой колонке геообъект.
en: This example uses the cluster balloon layout "cluster#balloonTwoColumns". This layout consists of two columns: a list of all geo objects and information about the selected geo object. Information about the selected geo object is defined as a separate layout and can be configured by using the option 'clusterBalloonItemContentLayout'. In this example, a custom layout is defined with information about a geo object. Layouts can be created with the [#$dp10] factory, using text templates. Text templates generate HTML content for the layout based on a hash with the data passed to the layout constructor. In this example, the data provider is the geo object selected in the left column.

source: Примеры. Кастомизация макета балуна кластера "Две колонки".
en: Examples. Customization of the "Two columns" cluster balloon layout.

source: Устанавливаем размер макета контента балуна (в пикселях).
en: Setting the size of the balloon content layout (in pixels).

source: Устанавливаем ширину левой колонки, в которой располагается список всех геообъектов кластера.
en: Setting the width of the left column, which contains a list of all geo objects in the cluster.

source: Часто возникает задача показать информацию об объекте в составе кластера. В таких случаях можно открыть балун кластера с нужной выбранной меткой.
en: It is often necessary to show information about an object that is in the cluster. In such cases, you can open the cluster balloon with the appropriate placemark selected.

source: Откроем балун на третьей метке в массиве.
en: Opening the balloon on the third placemark in the array.

source: Если метка находится в кластере, выставим ее в качестве активного объекта. Тогда она будет "выбрана" в открытом балуне кластера.
en: If the placemark is in a cluster, it will be set as the active object. This means it will be "selected" in the cluster's open balloon.

source: Если метка не попала в кластер и видна на карте, откроем ее балун.
en: If the placemark was not included in a cluster and is visible on the map, its balloon will open.

source: Примеры. Открытие балуна кластера с выбранным объектом
en: Examples. Opening the cluster balloon with the selected object

source: Примеры. Динамическая загрузка содержимого балуна
en: Examples. Dynamically loading balloon content

source: Метка, содержимое балуна которой загружается с помощью AJAX.
en: A placemark with balloon contents loaded using AJAX.

source: Запретим замену обычного балуна на балун-панель.
en: Disabling the replacement of the conventional balloon with the balloon panel.

source: Заставляем балун открываться даже если в нем нет содержимого.
en: Making the balloon open even if there is no content.

source: Обрабатываем событие открытия балуна на геообъекте: начинаем загрузку данных, затем обновляем его содержимое.
en: Handling the event of opening the balloon on the geo object: begin loading data, then updating its contents.

source: Имитация задержки при загрузке данных (для демонстрации примера).
en: Imitating a delay when loading data (for demonstration purposes).

source: Задаем новое содержимое балуна в соответствующее свойство метки.
en: Setting the new content of the balloon in the corresponding placemark property.

source: [#$dp7] - класс, позволяющий добавить на карту большое количество объектов без необходимости создавать метки по отдельности.
en: [#$dp7] - class that allows you to add a large number of objects to the map without having to create placemarks separately.

source: События на оверлеях объектов пропагируются в родительские коллекции. В событии в поле objectId передается уникальный идентификатор объекта, на котором произошло событие. Идентификаторы для одиночных объектов задаются пользователем, а для кластеров генерируются автоматически при создании.
en: Events on object overlays propagate to the parent collections. The unique ID of the object on which the event occurred is passed in the objectID field of the event. IDs for single objects are set by the user, and for clusters they are generated automatically during cluster creation.

source: Примеры. Обработка событий в ObjectManager
en: Examples. Event handling in ObjectManager

source: Метод setObjectOptions позволяет задавать опции объекта "на лету".
en: The setObjectOptions method allows you to set object options "on the fly".

source: Довольно часто возникает задача геокодирования (прямого и обратного) множества географических объектов.
en: It is often necessary to geocode (forward and reverse) a large number of geographical objects.

source: Сервис геокодирования позволяет за один запрос получить данные только для одного адреса (или одной пары координат). При этом обмен данными с сервером происходит в асинхронном режиме, то есть результаты геокодирования могут быть возвращены в произвольном порядке.
en: The geocode service allows to get data for a single address (or one pair of coordinates) per request. In addition, communication with the server takes place asynchronously, so geocoding results can be returned in an arbitrary order.

source: С помощью метода [#$dp12] и класса [#$dp13] можно объединять несколько асинхронных запросов в цепочку и затем обрабатывать ответ сразу от нескольких запросов.
en: You can use the [#$dp12] method and [#$dp13] class to combine multiple asynchronous requests in a chain and then process the response from several requests at once.

source: Для случаев, когда требуется геокодировать на клиенте одни и те же точки много раз, лучше реализовать геокодирование на стороне сервера с кешированием результатов. Подробнее об этой технологии читайте в руководстве разработчика.
en: For those cases when you need to geocode the same points multiple times on the client side, it is better to implement server-side geocoding with caching of results. For more information about this technology, see the Developer's Guide.

source: Примеры. Множественное геокодирование
en: Examples. Multiple geocoding

source: Можно создать выборку из запроса к геокодеру. В этом случае результаты запроса будут добавлены в выборку после того, как сервер вернет ответ. Обратите внимание, что наилучшим решением будет множественное геокодирование на сервере. Подробнее про множественное геокодирование читайте в руководстве разработчика.
en: You can create a selection from the request to the geocoder. In this case, the results will be added to the sample when the server returns the response. Please note that the best solution is multiple geocoding on the server. For more information about multiple geocoding, see the Developer's Guide.

source: Также в выборку можно добавлять несколько запросов к геокодеру. Они выполнятся по цепочке.
en: You can also add multiple geocoder requests to the selection. They will be executed in sequence.

source: После того, как все запросы обработаются, они будут добавлены на карту.
en: After all requests are processed, they will be added to the map.

source: Обратите внимание, что все операции асинхронные, поэтому для продолжения работы с выборкой следует дождаться готовности данных.
en: Note that all operations are asynchronous, so you will need to wait for data to be prepared before you can continue working with the selection.

source: Этот код выполнится после того, как все запросы к геокодеру вернут ответ и объекты будут добавлены на карту.
en: This code will be executed after all the requests to the geocoder return a response and objects are added to the map.

source: В примере при клике на карте появляется метка с адресом точки, в которой произошло нажатие.
en: In the example, when the map is clicked, a placemark appears with the address of the point that was clicked.

source: Здесь слушаются два события: клик на карте и перетаскивания метки. При наступлении одного из них происходит обращение к геокодеру с координатами точки, в которой произошло событие. Полученный адрес будет записан в качестве содержимого метки.
en: Here two events are listened for: a click on the map and dragging the marker. When one of them occurrs, a request is sent to the geocoder with the coordinates of the point at which the event occurred. The resulting address is recorded as the placemark content.

source: Примеры. Определение адреса клика на карте с помощью обратного геокодирования
en: Examples. Determining the address of a click on the map using reverse geocoding

source: Кликните по карте, чтобы узнать адрес
en: Click on the map to get the address

source: Слушаем клик на карте
en: Listening for a click on the map

source: Если метка уже создана – просто передвигаем ее
en: Moving the placemark if it was already created

source: Если нет – создаем.
en: Otherwise, creating it.

source: Слушаем событие окончания перетаскивания на метке.
en: Listening for the dragging end event on the placemark.

source: Создание метки
en: Creating a placemark

source: Определяем адрес по координатам (обратное геокодирование)
en: Determining the address by coordinates (reverse geocoding)

source: С помощью класса [#$dp9] можно формировать набор меток на карте из JSON-описаний их геометрий.
en: Using the [#$dp9] class, you can create a set of placemarks on the map from JSON-descriptions of their geometries.

source: В данном примере показано, как проверять попадание объектов в окружность и изменять их опции через [#$dp12].
en: This example shows how to check whether objects fall within a circle and how to change their options using [#$dp12].

source: Объекты, попадающие в круг, будут становиться красными.
en: Objects that fall in the circle will turn red.

source: Оставшиеся объекты - синими.
en: The remaining objects are blue.

source: Примеры. Попадание объектов в окружность.
en: Examples. Objects falling within a circle.

source: Перетаскивайте круг и следите за цветом меток
en: Drag the circle and watch the placemark's color

source: YMapsML позволяет задавать внешний вид отображаемых на карте объектов. Изменение внешнего вида отображаемых объектов производится с помощью стилей. Стили позволяют задавать некоторые параметры отображения геообъектов и формировать их произвольное HTML-представление с помощью шаблонов (см. пример использования шаблонов).
en: YMapsML allows you to set the appearance of objects displayed on the map. The appearance of displayed objects is changed using styles. Styles let you set certain parameters for displaying geo objects and generate custom HTML representation using templates (see the example of using templates).

source: Для определения стилей используется элемент repr:Style, который размещается в элементе repr:Representation.
en: To define styles, use the repr:Style element, which is located in the repr:Representation element.

source: Чтобы указать, какой стиль следует применять при отображении объекта, в элементе ymaps:GeoObject следует задать элемент ymaps:style. В нем указывается ссылка на стиль, который был определен в элементе repr:Style. Таким же способом в элементе ymaps:GeoObjectCollection можно задавать стиль для коллекции геообъектов.
en: To specify which style to apply for displaying an object, set the ymaps:style element in the ymaps:GeoObject element. It should contain a link to a style that was defined in the repr:Style element. The style for a collection of geo objects can be set the same way in the ymaps:GeoObjectCollection element.

source: Примеры YMapsML. Задание стиля объектов.
en: YMapsML examples. Setting styles for objects.

source: Для создания собственного балуна "с нуля" можно использовать фабрику [#$dp8]. При этом класс балуна должен реализовывать интерфейс [#$dp9].
en: To create your own balloon "from scratch", you can use the [#$dp8] factory. The balloon class must implement the [#$dp9] interface.

source: Чтобы балун поддерживал автопозиционирование, то есть автоматически подстраивался под размер содержимого, необходимо правильно оповещать о его текущих размерах. Для этого необходимо реализовать метод getShape().
en: In order for the balloon to support autopositioning, meaning it automatically adjusts to the size of the content, you need to correctly state its current size. To do this, implement the getShape() method.

source: При изменении контента балуна в методе onSublayoutSizeChange() следует переопределять опцию offset и кидать событие shapechange.
en: When you change the content of a balloon in the onSublayoutSizeChange() method, override the offset option and throw the shapechange event.

source: Примеры. Пользовательский макет балуна с поддержкой автопозиционирования.
en: Examples. Custom balloon layout with autopositioning.

source: Задать заголовок балуна Задать содержимое балуна
en: Set the title of a balloon Set the contents of a balloon

source: Создание экземпляра карты и его привязка к созданному контейнеру.
en: Creating an instance of the map and binding it to the created container.

source: Создание макета балуна на основе Twitter Bootstrap.
en: Creating a balloon layout based on Twitter Bootstrap.

source: Строит экземпляр макета на основе шаблона и добавляет его в родительский HTML-элемент.
en: Builds an instance of a layout based on a template and adds it to the parent HTML element.

source: Удаляет содержимое макета из DOM.
en: Removes the layout contents from DOM.

source: Метод будет вызван системой шаблонов АПИ при изменении размеров вложенного макета.
en: The method will be invoked by the API's template system when resizing the nested layout.

source: Сдвигаем балун, чтобы "хвостик" указывал на точку привязки.
en: Moving the balloon so the "tail" points at the anchor point.

source: Закрывает балун при клике на крестик, кидая событие "userclose" на макете.
en: Closes the balloon when the "x" is clicked, throwing the "userclose" event on the layout.

source: Используется для автопозиционирования (balloonAutoPan).
en: Used for autopositioning (balloonAutoPan).

source: @returns {Number[][]} Координаты левого верхнего и правого нижнего углов шаблона относительно точки привязки.
en: @returns {Number[][]} The coordinates of the top left and bottom right corners of the template relative to the anchor point.

source: Проверяем наличие элемента (в ИЕ и Опере его еще может не быть).
en: Checking the availability of the item (in IE and Opera it might not be there yet).

source: @param {jQuery} [element] Элемент.
en: @param {jQuery} [element] Element.

source: @returns {Boolean} Флаг наличия.
en: @returns {Boolean} Availability flag.

source: Создание вложенного макета содержимого балуна.
en: Creating a nested layout for balloon content.

source: Создание метки с пользовательским макетом балуна.
en: Creating a placemark with a custom balloon layout.

source: Не скрываем иконку при открытом балуне. hideIconOnBalloonOpen: false, И дополнительно смещаем балун, для открытия над иконкой. balloonOffset: [3, -40]
en: Not hiding the icon when the balloon is open. hideIconOnBalloonOpen: false, And additionally moving the balloon to open over the icon. balloonOffset: [3, -40]

source: Поиск объекта по его названию реализуется с помощью функции [#$dp11]. Однако, эта функция производит поиск среди объектов, размещенных на обычной или народной карте.
en: Searching for an object by name is implemented using the [#$dp11] function. However, this function searches among the objects placed on the regular or public map.

source: А что делать, если необходимо организовать поиск по собственным объектам и интегрировать его с API Яндекс.Карт? Написать собственный провайдер поиска, который можно использовать в функции [#$dp14] и элементе управления «Поиск по карте».
en: What if you want to organize the search across custom objects and integrate it with the Yandex.Maps API? Write your own search provider, which can be used in the [#$dp14] function and the "Search on map" control.

source: Провайдер поиска должен реализовывать интерфейс [#$dp18]. Данный пример показывает, как написать собственный провайдер и подключить его к стандартному элементу управления «Поиск по карте».
en: The search provider must implement the [#$dp18] interface. This example shows how to write your own provider and connect it to the standard "Search on map" control.

source: @param {Object[]} points Массив с точками.
en: @param {Object[]} points Array of points.

source: Ищем запрос в свойстве text каждого элемента массива и записываем найденные результаты в новый.
en: Looking for the query in the "text" property of each item in the array and writing the found results to a new one.

source: Записываем количество найденных результатов.
en: Writing the number of results found.

source: Добавляем элемент управления на карту.
en: Adding a control to the map.

source: Примеры. Собственный провайдер поиска в API 2.1.
en: Examples. Custom search provider in the API 2.1.

source: Данный пример показывает, как можно автоматически строить маршрут и рассчитывать стоимость поездки или доставки. Если кликнуть в любое место на карте или вбить нужный адрес в поисковую строку, то на карте отобразится точка с проложенным к ней маршрутом и информацией о стоимости поездки (доставки).
en: This example shows how you can automatically build a route and calculate the cost of travel or delivery. If you click anywhere on the map or enter the desired address in the search box, a point is displayed on the map with a route drawn to it and information about the cost of the trip (delivery).

source: Чтобы отметить начальную и конечную точки, достаточно кликнуть в нужных местах на карте либо ввести адреса в соответствующих поисковых строках.
en: To mark the starting and ending points, just click in the desired places on the map or enter addresses in the search boxes.

source: При клике на метке начальной точки откроется балун с информацией о маршруте и стоимости доставки.
en: When you click on the starting point placemark, a balloon opens with information about the route and cost of delivery.

source: Константы.
en: Constants.
